package ru.murtazin.homeworks.homework17;

/**
 * Домашнее задание 17
 * Написать свой класс MyLinkedList поддерживающий методы
 * addFirst(T data) - добавляет элемент в начало списка, остальные сдвигаются вправо
 * addLast(T data) - добавляет элемент в конец списка
 * T getFirst() - возвращает первый элемент списка
 * T getLast() - возвращает последний элемент списка
 * add(int position, T data) - вставляет элемент на позицию с номером position, остальные элементы сдвигаются вправо
 * T remove(int position) - удаляет элемент с номером position
 * T get(int position) - возвращает элемент с номером posiion
 * int getSize() - возвращает количество элементов в списке.
 * На основе разработанного MyLinkedList создать класс MyQueue работающий по принципу очереди, и имеющий два метода
 * offer(T data), добавляющий элемент в очередь и T poll() - забирающий элемент из очереди
 * На основе разработанного MyLinkedList построить класс MyStack имеющий два метода -
 * push(T data) - помещающий элемент в стек и T pop() - достающий элемент из стека
 * Написать функцию int[] sort(int[] array) - возвращающий отсортированный по возрастанию массив.
 * Готовыми методами сортировки не пользоваться - использовать алгоритм сортировки пузырьком
 * ** В задании выше осуществить сортировку с помощью алгоритма quicksort или слиянием (сложность O(N log(N))
 */
public class Main {
    public static void main(String[] args) {

    }
}

class MyLinkedList{

}
