package ru.murtazin.homeworks.homework20;

/**
 * Домашнее задание 20. (Работа с сетью)
 * Сервер: выполняет математические вычисления: +,-,*,/
 * Клиент-серверное взаимодействие:
 * - клиент подключается к серверу, получает строку с доступными математическими операциями. Отображает ее пользователю.
 * - пользователь вводит два числа и команду в консоль
 * - отправляется запрос на сервер, сервер выполняет вычисления, возвращает результат клиенту.
 * - клиент отображает результат в консоль
 */
public class Main {
    public static void main(String[] args) {

    }
}
